#+Title: Exercise 5.19

** Unknown label test

#+begin_src scheme :session 5-19 :results output verbatim :exports both
  (set-breakpoint fact 'before-fact 1)
#+end_src

#+RESULTS:
: ERROR: In procedure scm-error:
: Unknown offset or label -- set-breakpoint before-fact
: 
: Entering a new prompt.  Type `,bt' for a backtrace or `,q' to continue.
: scheme@(guile-user) [13]> 

** Invalid offset test
#+begin_src scheme :session 5-19 :results output verbatim :exports both
  (set-breakpoint fact 'after-fact 0)
#+end_src

#+RESULTS:
: ERROR: In procedure scm-error:
: Cannot install breakpoint before label -- set-breakpoint
: 
: Entering a new prompt.  Type `,bt' for a backtrace or `,q' to continue.
: scheme@(guile-user) [14]> 


** Test execution of machine having breakpoints
#+begin_src scheme :session 5-19 :exports both :results output verbatim
  (set-register-contents! fact 'n 3)
  (start fact)
#+end_src

#+RESULTS:
: breakpoint -> after-fact 1

#+begin_src scheme :session 5-19 :exports both :results output verbatim
  (proceed-machine fact)
#+end_src

#+RESULTS:
: breakpoint -> after-fact 3

#+begin_src scheme :session 5-19 :exports both :results output verbatim
  (proceed-machine fact)
#+end_src

#+RESULTS:
: breakpoint -> after-fact 1

#+begin_src scheme :session 5-19 :exports both :results output verbatim
  (proceed-machine fact)
#+end_src

#+RESULTS:
: breakpoint -> after-fact 3

#+begin_src scheme :session 5-19 :exports both
  (proceed-machine fact)
#+end_src

#+RESULTS:
: done

#+begin_src scheme :session 5-19 :exports both
  (get-register-contents fact 'val)
#+end_src

#+RESULTS:
: 6


